<a href="https://colab.research.google.com/github/Chansikan/Python-tutorial/blob/master/Tutorial15and16.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Let's learn Python together!
#### *for machine learning researchers without computer science background*

## Lesson 15, 16: Subsetting DataFrame

### **Different choices for indexing**

1. Indexer (i.e., [ ]) 사용

2. Method (i.e., loc, iloc) 사용 (recommended; robust and consistent)
  - Selection by label, using 'loc' method
  - Selection by position, using 'iloc' method

In [0]:
import numpy as np
import pandas as pd

# dictionary of 5 patients
gbm_dict = {
    'MRN': ['1234567', '1234568', '1234569', '1234570', '1234571'],
    'age': [60, 70, 65, 76, 63],
    'sex': ['male', 'female', 'female', 'male', 'male'],
    'PS': [90, 80, 50, 70, 100],
    'gene_mt': [1, 0, 1, 0, 1], 
    'EOR': ['subtotal', 'total', 'biopsy', 'partial', 'total'],
    'death': [1, 0, 0, 1, 1], 
    'survival': [300, 220, 400, 320, 280]
}

gbm_df = pd.DataFrame.from_dict(gbm_dict)

gbm_df

       MRN  age     sex   PS  gene_mt       EOR  death  survival
0  1234567   60    male   90        1  subtotal      1       300
1  1234568   70  female   80        0     total      0       220
2  1234569   65  female   50        1    biopsy      0       400
3  1234570   76    male   70        0   partial      1       320
4  1234571   63    male  100        1     total      1       280

### 1) Using [ ]
A. 하나 혹은 다수의 label을 이용하여 Series의 value or item 혹은 DataFrame의 ***column***을 추출

In [0]:
### DataFrame['column_name']
# single column
d = gbm_df['MRN']

# multiple columns
gbm_df[ ['MRN', 'age'] ]

# answering to a question from a viwer...

       MRN  age
0  1234567   60
1  1234568   70
2  1234569   65
3  1234570   76
4  1234571   63

In [0]:
### NUMPY
import numpy as np
c = np.array([[1, 2, 3, 4],
               [5, 6, 7, 8]])
row_index = 1
col_index = [0, 2]
#c[row_index, col_index]
c[row_index, col_index]

array([5, 7])

In [0]:
# select columns with a different order
print(gbm_df[['MRN', 'age']])
print(gbm_df[['age', 'MRN']])

       MRN  age
0  1234567   60
1  1234568   70
2  1234569   65
3  1234570   76
4  1234571   63
   age      MRN
0   60  1234567
1   70  1234568
2   65  1234569
3   76  1234570
4   63  1234571

In [0]:
# swap the values?
gbm_df[['MRN', 'age']] = gbm_df[['age', 'MRN']]
gbm_df['test'] = [1, 2, 3, 4, 5]
gbm_df

       MRN  age     sex   PS  gene_mt       EOR  death  survival  test
0  1234567   60    male   90        1  subtotal      1       300     1
1  1234568   70  female   80        0     total      0       220     2
2  1234569   65  female   50        1    biopsy      0       400     3
3  1234570   76    male   70        0   partial      1       320     4
4  1234571   63    male  100        1     total      1       280     5

In [0]:
### Series[label]
gbm_series = gbm_df['age']
gbm_series
#gbm_series.index = ['a', 'b', 'c', 'd', 'e']

#gbm_series2 = gbm_df.loc[2]

#gbm_series2[['MRN', 'PS', 'EOR']]

0    60
1    70
2    65
3    76
4    63
Name: age, dtype: int64

B. 위치를 나타내는 정수 값을 넣어 Series의 value or item 혹은 DataFrame의 ***row***을 추출

In [0]:
### Series
gbm_df

       MRN  age     sex   PS  gene_mt       EOR  death  survival  test
0  1234567   60    male   90        1  subtotal      1       300     1
1  1234568   70  female   80        0     total      0       220     2
2  1234569   65  female   50        1    biopsy      0       400     3
3  1234570   76    male   70        0   partial      1       320     4
4  1234571   63    male  100        1     total      1       280     5

In [0]:
### DataFrame
gbm_df[,2:3]
# NOTE: Using this method, we can slice the ranges of a dataframe, 
#       but cannot select a single row.

#gbm_df[2, 3]

# loc, iloc

SyntaxError: ignored

### 2) Using loc or iloc
  - Selection by label, using 'loc' method
  - Selection by position, using 'iloc' method

In [0]:
gbm_df

       MRN  age     sex   PS  gene_mt       EOR  death  survival  test
0  1234567   60    male   90        1  subtotal      1       300     1
1  1234568   70  female   80        0     total      0       220     2
2  1234569   65  female   50        1    biopsy      0       400     3
3  1234570   76    male   70        0   partial      1       320     4
4  1234571   63    male  100        1     total      1       280     5

In [0]:
# Set the index to become the 'MRN' column
gbm_df.set_index('MRN', inplace=True)
# check the type of MRN: column vs. index
gbm_df

         age     sex   PS  gene_mt       EOR  death  survival  test
MRN
1234567   60    male   90        1  subtotal      1       300     1
1234568   70  female   80        0     total      0       220     2
1234569   65  female   50        1    biopsy      0       400     3
1234570   76    male   70        0   partial      1       320     4
1234571   63    male  100        1     total      1       280     5

In [0]:
# .loc: select by label
# 1) without dimension
gbm_df.loc[::-1]

# 2) with dimension (row and column)
#gbm_df.loc[:, 'PS':]

         age     sex   PS  gene_mt       EOR  death  survival  test
MRN
1234571   63    male  100        1     total      1       280     5
1234570   76    male   70        0   partial      1       320     4
1234569   65  female   50        1    biopsy      0       400     3
1234568   70  female   80        0     total      0       220     2
1234567   60    male   90        1  subtotal      1       300     1

In [0]:
# 3) using Boolean array
only_female = gbm_df['sex'] == 'female'
col_index = [True if 'e' in col else False for col in gbm_df.columns]

gbm_df.loc[only_female, col_index]

type(only_female)

pandas.core.series.Series

In [0]:
gbm_df

         age     sex   PS  gene_mt       EOR  death  survival
MRN
1234567   60    male   90        1  subtotal      1       300
1234568   70  female   80        0     total      0       220
1234569   65  female   50        1    biopsy      0       400
1234570   76    male   70        0   partial      1       320
1234571   63    male  100        1     total      1       280

In [0]:
# .iloc: select by position
# 1) without dimension

# 2) with dimension (row and column)
gbm_df.iloc[[1, 3, 4], ::-1]

         survival  death      EOR  gene_mt   PS     sex  age
MRN
1234568       220      0    total        0   80  female   70
1234570       320      1  partial        0   70    male   76
1234571       280      1    total        1  100    male   63

In [0]:
gbm_df.iloc[only_female.values, ::-1]

#only_female.values

         survival  death     EOR  gene_mt  PS     sex  age
MRN
1234568       220      0   total        0  80  female   70
1234569       400      0  biopsy        1  50  female   65